%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%%%     antilog2 function                                                   %%%
%%%     x- 计算输入值                                                       %%%
%%%     frac- 所占小数位                                                    %%%
%%%     result- 计算结果，值为2^(x/(2^frac))                                %%%
%%%                                                                         %%%
%%%     Created by 李嘉宝 2021.05.25 version 1.0                            %%%
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%

function [ result ] = antilog2(x, frac)

    result = 2^(x/(2^frac));

end